## Pandas Indexing

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame(np.arange(4,20).reshape(4,4),columns=list('abcd'))

In [3]:
df

    a   b   c   d
0   4   5   6   7
1   8   9  10  11
2  12  13  14  15
3  16  17  18  19

In [4]:
df['a']

0     4
1     8
2    12
3    16
Name: a, dtype: int64

In [5]:
df[:3]

    a   b   c   d
0   4   5   6   7
1   8   9  10  11
2  12  13  14  15

In [6]:
df[['a','b','c']]

    a   b   c
0   4   5   6
1   8   9  10
2  12  13  14
3  16  17  18

In [9]:
df.loc[1] #numpy indexing - row

a     8
b     9
c    10
d    11
Name: 1, dtype: int64

In [11]:
df.loc[:1]

   a  b   c   d
0  4  5   6   7
1  8  9  10  11

In [12]:
df.loc[:1,'c':'d']

    c   d
0   6   7
1  10  11

In [13]:
df

    a   b   c   d
0   4   5   6   7
1   8   9  10  11
2  12  13  14  15
3  16  17  18  19

In [17]:
df.iloc[:1,:2] #by position,exclusive at the end

   a  b
0  4  5

## Removing a column

In [21]:
# wrong > df.drop('d')
df.drop(0)

    a   b   c   d
1   8   9  10  11
2  12  13  14  15
3  16  17  18  19

In [23]:
df.drop('d',axis=1) #column drop

    a   b   c
0   4   5   6
1   8   9  10
2  12  13  14
3  16  17  18

In [24]:
df.drop('a',axis=1, inplace=True) #destructive
# AXIS 0 ROW, AXIS 1 COL

In [25]:
df

    b   c   d
0   5   6   7
1   9  10  11
2  13  14  15
3  17  18  19

In [27]:
df.shape

(4, 3)

In [28]:
del df['b']

In [29]:
df

    c   d
0   6   7
1  10  11
2  14  15
3  18  19

In [2]:
import pandas as pd
data= pd.read_csv('DOHMH_Dog_Bite_Data.csv')

In [9]:
data.head(4)

,UniqueID,DateOfBite,Species,Breed,Age,Gender,SpayNeuter,Borough,ZipCode
0,1,January 02 2015,DOG,"Poodle, Standard",3,M,True,Brooklyn,11238
1,2,January 02 2015,DOG,HUSKY,NaN,U,False,Brooklyn,11249
2,3,January 02 2015,DOG,NaN,NaN,U,False,Brooklyn,NaN
3,4,January 01 2015,DOG,American Pit Bull Terrier/Pit Bull,6,M,False,Brooklyn,11221

In [33]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10280 entries, 0 to 10279
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   UniqueID    10280 non-null  int64
 1   DateOfBite  10280 non-null  object
 2   Species     10280 non-null  object
 3   Breed       8692 non-null   object
 4   Age         5534 non-null   object
 5   Gender      10280 non-null  object
 6   SpayNeuter  10280 non-null  bool
 7   Borough     10280 non-null  object
 8   ZipCode     7613 non-null   object
dtypes: bool(1), int64(1), object(7)
memory usage: 652.7+ KB

In [34]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [35]:
df.columns

Index(['c', 'd'], dtype='object')

In [36]:
df

    c   d
0   6   7
1  10  11
2  14  15
3  18  19

In [38]:
df.columns[0]='what' #cannot change names by assignment

TypeError: Index does not support mutable operations

In [40]:
df

    c   d
0   6   7
1  10  11
2  14  15
3  18  19

In [41]:
df[['d','d','c']]

    d   d   c
0   7   7   6
1  11  11  10
2  15  15  14
3  19  19  18

In [42]:
df[['d','d','c','x']]

KeyError: "['x'] not in index"

## Reindexing

In [43]:
df.reindex(columns=['d','c','x'])

    d   c   x
0   7   6 NaN
1  11  10 NaN
2  15  14 NaN
3  19  18 NaN

In [47]:
# fill a row wiht particular number 
s= pd.Series([5,7],list('ac'))

In [48]:
s.reindex(list('abcde'),method='ffill')

a    5
b    5
c    7
d    7
e    7
dtype: int64

In [10]:
import pandas as pd
d = [["$229.2", 2017, 123000, "$1100", "Cupertino, US"],
     ["$211.9", 2017, 320671, "$284", "Suwon, South Korea"],
     ["$177.8", 2017, 566000, "$985",  "Seattle, US"],
     ["$154.7", 2017, 1300000, "$66", "New Taipei City, Taiwan"],
     ["$110.8", 2017, 80110, "$834", "Mountain View, US"]]

comps = ["apple", "samsung", "amazon", "foxconn", "alphabet"]
cols = ["revenue", "fy", "employees", "mcap", "location"]

c = pd.DataFrame(d, index=comps, columns=cols)

In [11]:
c

         revenue    fy  employees   mcap                 location
apple     $229.2  2017     123000  $1100            Cupertino, US
samsung   $211.9  2017     320671   $284       Suwon, South Korea
amazon    $177.8  2017     566000   $985              Seattle, US
foxconn   $154.7  2017    1300000    $66  New Taipei City, Taiwan
alphabet  $110.8  2017      80110   $834        Mountain View, US

In [51]:
del c['fy']

In [53]:
c.drop('mcap',axis=1,inplace=True)

In [55]:
c

         revenue  employees                 location
apple     $229.2     123000            Cupertino, US
samsung   $211.9     320671       Suwon, South Korea
amazon    $177.8     566000              Seattle, US
foxconn   $154.7    1300000  New Taipei City, Taiwan
alphabet  $110.8      80110        Mountain View, US

In [56]:
c['employees']

apple        123000
samsung      320671
amazon       566000
foxconn     1300000
alphabet      80110
Name: employees, dtype: int64

In [58]:
c.loc[:,'employees']

apple        123000
samsung      320671
amazon       566000
foxconn     1300000
alphabet      80110
Name: employees, dtype: int64

In [60]:
c['revenue']

apple       $229.2
samsung     $211.9
amazon      $177.8
foxconn     $154.7
alphabet    $110.8
Name: revenue, dtype: object

In [61]:
c['revenue']['amazon']

'$177.8'

In [62]:
c

         revenue  employees                 location
apple     $229.2     123000            Cupertino, US
samsung   $211.9     320671       Suwon, South Korea
amazon    $177.8     566000              Seattle, US
foxconn   $154.7    1300000  New Taipei City, Taiwan
alphabet  $110.8      80110        Mountain View, US

In [63]:
c.loc['apple':'amazon'][['revenue','location']]

        revenue            location
apple    $229.2       Cupertino, US
samsung  $211.9  Suwon, South Korea
amazon   $177.8         Seattle, US

In [64]:
c

         revenue  employees                 location
apple     $229.2     123000            Cupertino, US
samsung   $211.9     320671       Suwon, South Korea
amazon    $177.8     566000              Seattle, US
foxconn   $154.7    1300000  New Taipei City, Taiwan
alphabet  $110.8      80110        Mountain View, US

In [65]:
# Add a column with series 
c['state']=pd.Series({'apple':'CA','amazon':'WA','alphabet':'CA'})

In [67]:
c

         revenue  employees                 location state
apple     $229.2     123000            Cupertino, US    CA
samsung   $211.9     320671       Suwon, South Korea   NaN
amazon    $177.8     566000              Seattle, US    WA
foxconn   $154.7    1300000  New Taipei City, Taiwan   NaN
alphabet  $110.8      80110        Mountain View, US    CA

In [68]:
c.loc['apple':'amazon',['revenue','location']]

        revenue            location
apple    $229.2       Cupertino, US
samsung  $211.9  Suwon, South Korea
amazon   $177.8         Seattle, US

In [69]:
c.iloc[:2]

        revenue  employees            location state
apple    $229.2     123000       Cupertino, US    CA
samsung  $211.9     320671  Suwon, South Korea   NaN

In [71]:
c['employees'] /100000

apple        1.23000
samsung      3.20671
amazon       5.66000
foxconn     13.00000
alphabet     0.80110
Name: employees, dtype: float64

In [72]:
# all info for all companies that have employees less than 200k 


c['employees'] <200000

apple        True
samsung     False
amazon      False
foxconn     False
alphabet     True
Name: employees, dtype: bool

In [73]:
c[c['employees'] <200000]

         revenue  employees           location state
apple     $229.2     123000      Cupertino, US    CA
alphabet  $110.8      80110  Mountain View, US    CA

In [74]:
c

         revenue  employees                 location state
apple     $229.2     123000            Cupertino, US    CA
samsung   $211.9     320671       Suwon, South Korea   NaN
amazon    $177.8     566000              Seattle, US    WA
foxconn   $154.7    1300000  New Taipei City, Taiwan   NaN
alphabet  $110.8      80110        Mountain View, US    CA

In [75]:
c['state'].notnull()

apple        True
samsung     False
amazon       True
foxconn     False
alphabet     True
Name: state, dtype: bool

In [76]:
c['state'].isnull()

apple       False
samsung      True
amazon      False
foxconn      True
alphabet    False
Name: state, dtype: bool

In [77]:
c[c['state'].isnull()]

        revenue  employees                 location state
samsung  $211.9     320671       Suwon, South Korea   NaN
foxconn  $154.7    1300000  New Taipei City, Taiwan   NaN

In [78]:
c.dropna()

         revenue  employees           location state
apple     $229.2     123000      Cupertino, US    CA
amazon    $177.8     566000        Seattle, US    WA
alphabet  $110.8      80110  Mountain View, US    CA

In [81]:
c.dropna(axis=1)

         revenue  employees                 location
apple     $229.2     123000            Cupertino, US
samsung   $211.9     320671       Suwon, South Korea
amazon    $177.8     566000              Seattle, US
foxconn   $154.7    1300000  New Taipei City, Taiwan
alphabet  $110.8      80110        Mountain View, US

## Vectorized String Methods

In [82]:
c['location'].str.upper()

apple                 CUPERTINO, US
samsung          SUWON, SOUTH KOREA
amazon                  SEATTLE, US
foxconn     NEW TAIPEI CITY, TAIWAN
alphabet          MOUNTAIN VIEW, US
Name: location, dtype: object

In [84]:
c['location']= c['location'].str.upper()

In [85]:
c

         revenue  employees                 location state
apple     $229.2     123000            CUPERTINO, US    CA
samsung   $211.9     320671       SUWON, SOUTH KOREA   NaN
amazon    $177.8     566000              SEATTLE, US    WA
foxconn   $154.7    1300000  NEW TAIPEI CITY, TAIWAN   NaN
alphabet  $110.8      80110        MOUNTAIN VIEW, US    CA

In [86]:
c['location'].str.split(',')

apple                 [CUPERTINO,  US]
samsung          [SUWON,  SOUTH KOREA]
amazon                  [SEATTLE,  US]
foxconn     [NEW TAIPEI CITY,  TAIWAN]
alphabet          [MOUNTAIN VIEW,  US]
Name: location, dtype: object

In [87]:
c['location'].str.split(',').str[-1]

apple                 US
samsung      SOUTH KOREA
amazon                US
foxconn           TAIWAN
alphabet              US
Name: location, dtype: object

In [88]:
c['country'] = c['location'].str.split(',').str[-1]

In [89]:
c

         revenue  employees                 location state       country
apple     $229.2     123000            CUPERTINO, US    CA            US
samsung   $211.9     320671       SUWON, SOUTH KOREA   NaN   SOUTH KOREA
amazon    $177.8     566000              SEATTLE, US    WA            US
foxconn   $154.7    1300000  NEW TAIPEI CITY, TAIWAN   NaN        TAIWAN
alphabet  $110.8      80110        MOUNTAIN VIEW, US    CA            US

## Reindexing

In [90]:
c.reindex(index=list(c.index[1:]) +['apple','microsoft'])

          revenue  employees                 location state       country
samsung    $211.9   320671.0       SUWON, SOUTH KOREA   NaN   SOUTH KOREA
amazon     $177.8   566000.0              SEATTLE, US    WA            US
foxconn    $154.7  1300000.0  NEW TAIPEI CITY, TAIWAN   NaN        TAIWAN
alphabet   $110.8    80110.0        MOUNTAIN VIEW, US    CA            US
apple      $229.2   123000.0            CUPERTINO, US    CA            US
microsoft     NaN        NaN                      NaN   NaN           NaN

## Apply, Map

* for dataframe you can use apply(entire row) or applymap(entire value )

In [91]:
import pandas as pd
rain = pd.DataFrame([[3.50, 4.53, 4.13, 3.98],
                     [7.91, 5.98, 6.10, 5.12],
                     [3.94, 5.28, 3.90, 4.49],
                     [1.42, 0.63, 0.75, 1.65]],
    index=['New York', 'New Orleans', 'Atlanta', 'Seattle'],
    columns=['Jun', 'Jul', 'Aug', 'Sept'])

In [92]:
rain

              Jun   Jul   Aug  Sept
New York     3.50  4.53  4.13  3.98
New Orleans  7.91  5.98  6.10  5.12
Atlanta      3.94  5.28  3.90  4.49
Seattle      1.42  0.63  0.75  1.65

In [98]:
rain.apply(lambda arg: str(type(arg))) # take a function and single arg will be a Series

Jun     <class 'pandas.core.series.Series'>
Jul     <class 'pandas.core.series.Series'>
Aug     <class 'pandas.core.series.Series'>
Sept    <class 'pandas.core.series.Series'>
dtype: object

In [97]:
rain.apply(lambda month_data: sum(month_data))

Jun     16.77
Jul     16.42
Aug     14.88
Sept    15.24
dtype: float64

In [99]:
rain.apply(sum) #axis is zero ! If you want to do axis 1. sest axis

Jun     16.77
Jul     16.42
Aug     14.88
Sept    15.24
dtype: float64

In [100]:
rain.apply(sum,axis=1)

New York       16.14
New Orleans    25.11
Atlanta        17.61
Seattle         4.45
dtype: float64

In [101]:
rain.mean()

Jun     4.1925
Jul     4.1050
Aug     3.7200
Sept    3.8100
dtype: float64

In [103]:
rain.mode(axis=1)

                0     1     2     3
New York     3.50  3.98  4.13  4.53
New Orleans  5.12  5.98  6.10  7.91
Atlanta      3.90  3.94  4.49  5.28
Seattle      0.63  0.75  1.42  1.65

In [105]:
rain.apply(lambda city_data: max(city_data)-min(city_data),axis=1)

New York       1.03
New Orleans    2.79
Atlanta        1.38
Seattle        1.02
dtype: float64

In [107]:
rain.applymap(lambda ele: f'{2.5 *ele:.2f} cm') #take a function but this takes one element

                  Jun       Jul       Aug      Sept
New York      8.75 cm  11.33 cm  10.32 cm   9.95 cm
New Orleans  19.77 cm  14.95 cm  15.25 cm  12.80 cm
Atlanta       9.85 cm  13.20 cm   9.75 cm  11.23 cm
Seattle       3.55 cm   1.57 cm   1.88 cm   4.12 cm

In [109]:
pd.Series(['ant', 'cat', 'bat']).map(lambda word: word + 's')

0    ants
1    cats
2    bats
dtype: object

In [113]:
def f(s):
    return s+'s'
pd.Series(['ant', 'cat', 'bat']).map(f)

0    ants
1    cats
2    bats
dtype: object

## Sorting

In [114]:
c.sort_index() #alphabetical order

         revenue  employees                 location state       country
alphabet  $110.8      80110        MOUNTAIN VIEW, US    CA            US
amazon    $177.8     566000              SEATTLE, US    WA            US
apple     $229.2     123000            CUPERTINO, US    CA            US
foxconn   $154.7    1300000  NEW TAIPEI CITY, TAIWAN   NaN        TAIWAN
samsung   $211.9     320671       SUWON, SOUTH KOREA   NaN   SOUTH KOREA

In [116]:
# sort by values
c.sort_values(by='employees')

         revenue  employees                 location state       country
alphabet  $110.8      80110        MOUNTAIN VIEW, US    CA            US
apple     $229.2     123000            CUPERTINO, US    CA            US
samsung   $211.9     320671       SUWON, SOUTH KOREA   NaN   SOUTH KOREA
amazon    $177.8     566000              SEATTLE, US    WA            US
foxconn   $154.7    1300000  NEW TAIPEI CITY, TAIWAN   NaN        TAIWAN

In [118]:
c.sort_values(by='employees',ascending=False)

         revenue  employees                 location state       country
foxconn   $154.7    1300000  NEW TAIPEI CITY, TAIWAN   NaN        TAIWAN
amazon    $177.8     566000              SEATTLE, US    WA            US
samsung   $211.9     320671       SUWON, SOUTH KOREA   NaN   SOUTH KOREA
apple     $229.2     123000            CUPERTINO, US    CA            US
alphabet  $110.8      80110        MOUNTAIN VIEW, US    CA            US

In [119]:
rain

              Jun   Jul   Aug  Sept
New York     3.50  4.53  4.13  3.98
New Orleans  7.91  5.98  6.10  5.12
Atlanta      3.94  5.28  3.90  4.49
Seattle      1.42  0.63  0.75  1.65

In [120]:
rain.describe()

            Jun       Jul       Aug      Sept
count  4.000000  4.000000  4.000000  4.000000
mean   4.192500  4.105000  3.720000  3.810000
std    2.711081  2.391129  2.212525  1.513605
min    1.420000  0.630000  0.750000  1.650000
25%    2.980000  3.555000  3.112500  3.397500
50%    3.720000  4.905000  4.015000  4.235000
75%    4.932500  5.455000  4.622500  4.647500
max    7.910000  5.980000  6.100000  5.120000

In [121]:
c['country'].unique()

array([' US', ' SOUTH KOREA', ' TAIWAN'], dtype=object)

In [123]:
c['country'].value_counts()

 US             3
 SOUTH KOREA    1
 TAIWAN         1
Name: country, dtype: int64

In [125]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10280 entries, 0 to 10279
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   UniqueID    10280 non-null  int64
 1   DateOfBite  10280 non-null  object
 2   Species     10280 non-null  object
 3   Breed       8692 non-null   object
 4   Age         5534 non-null   object
 5   Gender      10280 non-null  object
 6   SpayNeuter  10280 non-null  bool
 7   Borough     10280 non-null  object
 8   ZipCode     7613 non-null   object
dtypes: bool(1), int64(1), object(7)
memory usage: 652.7+ KB

In [126]:
data.describe() #only for numeric cols , ignore missing data

           UniqueID
count  10280.000000
mean    5140.500000
std     2967.724718
min        1.000000
25%     2570.750000
50%     5140.500000
75%     7710.250000
max    10280.000000

## Importing data

In [127]:
pd.read_csv('DOHMH_Dog_Bite_Data.csv')

,UniqueID,DateOfBite,Species,Breed,Age,Gender,SpayNeuter,Borough,ZipCode
0,1,January 02 2015,DOG,"Poodle, Standard",3,M,True,Brooklyn,11238
1,2,January 02 2015,DOG,HUSKY,NaN,U,False,Brooklyn,11249
2,3,January 02 2015,DOG,NaN,NaN,U,False,Brooklyn,NaN
3,4,January 01 2015,DOG,American Pit Bull Terrier/Pit Bull,6,M,False,Brooklyn,11221
4,5,January 03 2015,DOG,American Pit Bull Terrier/Pit Bull,1,M,False,Brooklyn,11207
...,...,...,...,...,...,...,...,...,...
10275,10276,December 24 2017,DOG,CHIWEENIE MIX,7,M,True,Staten Island,10303
10276,10277,December 24 2017,DOG,DUNKER,5,F,True,Staten Island,10303
10277,10278,December 21 2017,DOG,"Schnauzer, Miniature",10M,M,True,Staten Island,10312
10278,10279,December 28 2017,DOG,Mixed/Other,NaN,F,False,Staten Island,10308
10279,10280,December 29 2017,DOG,BOXER/PIT BULL,NaN,M,False,Staten Island,10314

### cleaning data through as type
* pd.to_numeric <-- ignore errors
* pd.to_datetime <-- specifing the format ex. %y-%m-%d